# ATIVIDADE 2 BIG DATA - 2024
# RUY DE MORAIS E SILVA

In [1]:
import psycopg2
import pandas as pd

# Variáveis de conexão com Elephant SQL
DATABASE = "nhjwuyyg"
USER = "nhjwuyyg"
PASSWORD = "pFPx0H-MMEGG60OS3YaPn_pM2KYIalOH"
HOST = "kesavan.db.elephantsql.com"
PORT = "5432" 

# String de conexão
conn_string = f"dbname='{DATABASE}' user='{USER}' password='{PASSWORD}' host='{HOST}' port='{PORT}'"

# Conectando ao banco de dados
try:
    conn = psycopg2.connect(conn_string)
    print("Conexão estabelecida!")
except Exception as e:
    print(f"Não foi possível conectar ao banco de dados: {e}")

Conexão estabelecida!

In [2]:
#Conectando cursor
cur = conn.cursor()

### a) Média salarial das mulheres
- **SELECT AVG(salario) AS media_salarial**: Calcula a média da coluna `salario`.
- **FROM empregado**: Especifica a tabela `empregado` de onde os dados são retirados.
- **WHERE sexo = 'F'**: Filtra os resultados para incluir apenas as entradas onde o campo `sexo` é igual a 'F', limitando os dados a empregados do sexo feminino.

In [3]:
# a) Calculando a média salarial das mulheres
query_3_a = """
SELECT AVG(salario) AS media_salarial
FROM empregado
WHERE sexo = 'F';
"""
df_a = pd.read_sql(query_3_a, conn)
df_a

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\134307248.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_a = pd.read_sql(query_3_a, conn)

   media_salarial
0         31000.0

### b) Contagem de empregados por supervisor
- **SELECT superssn AS supervisor_ssn, COUNT(*) AS numero_de_empregados**: `superssn` é renomeado para `supervisor_ssn` e `COUNT(*)` conta o número total de empregados para cada supervisor.
- **FROM empregado**: A consulta é realizada na tabela `empregado`.
- **WHERE superssn IS NOT NULL**: Exclui empregados que não têm um supervisor atribuído.
- **GROUP BY superssn**: Agrupa os empregados por seu supervisor, o que é essencial para a contagem por grupo.

In [4]:
# b) Contando empregados por supervisor
query_3_b = """
SELECT superssn AS supervisor_ssn, COUNT(*) AS numero_de_empregados
FROM empregado
WHERE superssn IS NOT NULL
GROUP BY superssn;
"""
df_b = pd.read_sql(query_3_b, conn)
df_b

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3526098916.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_b = pd.read_sql(query_3_b, conn)

  supervisor_ssn  numero_de_empregados
0      888665555                     4
1      943775543                     1
2      987654321                     1
3      333445555                     3

### c) Máximo de horas trabalhadas
- **SELECT MAX(horas) AS max_horas**: Usa a função `MAX` para encontrar o maior valor na coluna `horas`.
- **FROM trabalha**: A consulta é realizada na tabela `trabalha`, que supostamente armazena as horas trabalhadas.

In [5]:
# c) Obtendo o máximo de horas trabalhadas
query_3_c = """
SELECT MAX(horas) AS max_horas
FROM trabalha;
"""
df_c = pd.read_sql(query_3_c, conn)
df_c

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\245790553.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_c = pd.read_sql(query_3_c, conn)

   max_horas
0       40.0

### d) Soma das horas por projeto
- **SELECT pjnome AS nome_projeto, SUM(horas) AS horas_totais_projeto**: `pjnome` é renomeado para `nome_projeto`, e `SUM(horas)` soma todas as horas trabalhadas por projeto.
- **FROM trabalha**: Especifica a tabela `trabalha` onde as horas são registradas.
- **JOIN projeto ON trabalha.pno = projeto.pnumero**: Realiza um `JOIN` entre as tabelas `trabalha` e `projeto` usando `pno` e `pnumero` para associar as horas trabalhadas a cada projeto.
- **GROUP BY pjnome**: Agrupa os resultados pelo nome do projeto, necessário para a soma das horas por projeto.

In [6]:
# d) Soma de horas trabalhadas por projeto
query_3_d = """
SELECT pjnome AS nome_projeto, SUM(horas) AS horas_totais_projeto
FROM trabalha
JOIN projeto ON trabalha.pno = projeto.pnumero
GROUP BY pjnome;
"""
df_d = pd.read_sql(query_3_d, conn)
df_d

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3021259070.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_d = pd.read_sql(query_3_d, conn)

       nome_projeto  horas_totais_projeto
0     Automatizacao                  40.0
1          ProdutoZ                  40.0
2          ProdutoY                  27.5
3  Novos Beneficios                  55.0
4          ProdutoX                  52.5
5     Reorganizacao                  15.0

### e) Média salarial por departamento
- **SELECT d.dnome AS nome_departamento, AVG(e.salario) AS media_salarial**: `d.dnome` é renomeado para `nome_departamento`, e `AVG(e.salario)` calcula a média salarial por departamento.
- **FROM empregado e**: Especifica a tabela `empregado` com um alias `e`.
- **JOIN departamento d ON e.dno = d.dnumero**: Conecta `empregado` a `departamento` usando a chave estrangeira `dno` para agrupar os salários por departamento.
- **GROUP BY d.dnome**: Agrupa os resultados pelo nome do departamento, necessário para calcular a média por cada um.

In [7]:
# e) Média salarial por departamento
query_3_e = """
SELECT d.dnome AS nome_departamento, AVG(e.salario) AS media_salarial
FROM empregado e
JOIN departamento d ON e.dno = d.dnumero
GROUP BY d.dnome;
"""
df_e = pd.read_sql(query_3_e, conn)
df_e

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1574209723.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_e = pd.read_sql(query_3_e, conn)

     nome_departamento  media_salarial
0        Administracao         31000.0
1             Pesquisa         33250.0
2  Sede Administrativa         57000.0

### f) Empregados com dois ou mais dependentes
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome do empregado.
- **FROM empregado e**: Consulta a partir da tabela `empregado` com o alias `e`.
- **JOIN dependente d ON e.ssn = d.essn**: Realiza um `JOIN` entre `empregado` e `dependente` usando o `ssn` do empregado e `essn` do dependente.
- **GROUP BY e.ssn, e.pnome, e.unome**: Agrupa os resultados por `ssn`, `pnome` e `unome` para garantir que a contagem de dependentes seja correta.
- **HAVING COUNT(d.essn) >= 2**: Filtra os empregados que têm dois ou mais dependentes, usando `HAVING` para aplicar condições após o agrupamento.

In [8]:
# f) Empregados com dois ou mais dependentes
query_3_f = """
SELECT e.pnome, e.unome
FROM empregado e
JOIN dependente d ON e.ssn = d.essn
GROUP BY e.ssn, e.pnome, e.unome
HAVING COUNT(d.essn) >= 2;
"""
df_f = pd.read_sql(query_3_f, conn)
df_f

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1338378611.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_f = pd.read_sql(query_3_f, conn)

   pnome  unome
0   Joao  Souza
1  Fabio   Will

### g) Departamento com o menor número de projetos
- **SELECT d.dnome AS nome_departamento, COUNT(p.pnumero) AS num_projetos**: `d.dnome` é renomeado para `nome_departamento`, e `COUNT(p.pnumero)` conta o número de projetos associados a cada departamento.
- **FROM departamento d**: Especifica a tabela `departamento` com um alias `d`.
- **JOIN projeto p ON d.dnumero = p.dnum**: Realiza um `JOIN` entre as tabelas `departamento` e `projeto` usando `dnumero` e `dnum` para relacionar cada departamento com os projetos que gerencia.
- **GROUP BY d.dnome**: Agrupa os resultados pelo nome do departamento, necessário para contar os projetos por departamento.
- **ORDER BY num_projetos ASC**: Ordena os departamentos pelo número de projetos de forma ascendente.
- **LIMIT 1**: Limita o resultado ao primeiro registro, que será o departamento com o menor número de projetos.

In [9]:
# g) Departamento com o menor número de projetos
query_3_g = """
SELECT d.dnome AS nome_departamento, COUNT(p.pnumero) AS num_projetos
FROM departamento d
JOIN projeto p ON d.dnumero = p.dnum
GROUP BY d.dnome
ORDER BY num_projetos ASC
LIMIT 1;
"""
df_g = pd.read_sql(query_3_g, conn)
df_g

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\2167505192.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_g = pd.read_sql(query_3_g, conn)

     nome_departamento  num_projetos
0  Sede Administrativa             1

### h) Extrair substring do endereço
- **SELECT SUBSTRING(endereco, 10, 13) AS parte_endereco**: Usa a função `SUBSTRING` para extrair uma parte específica do endereço começando do décimo caractere e pegando os próximos 13 caracteres, pois até (-1) no caso 12.
- **FROM empregado**: A consulta é realizada na tabela `empregado`, que armazena os endereços dos empregados.

In [10]:
# h) Extrair substring do endereço
query_3_h = """
SELECT SUBSTRING(endereco, 10, 13) AS parte_endereco
FROM empregado;
"""
df_h = pd.read_sql(query_3_h, conn)
df_h

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1315259870.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_h = pd.read_sql(query_3_h, conn)

  parte_endereco
0  maio, 1500 -
1  s, 325 - Curi
2   291 - Colomb
3  ira, 55 - Alm
4  Lapa, 23 - Cu
5   1245 - Curit
6   450 - Curiti
7   – Araucária
8  a, 98 - Pinha
9   – Araucária

### i) Extrair mês do nascimento
- **SELECT EXTRACT(MONTH FROM datanasc) AS mes_nascimento**: Utiliza a função `EXTRACT` para obter o mês da data de nascimento dos empregados.
- **FROM empregado**: A consulta é realizada na tabela `empregado`, que contém as datas de nascimento.

In [11]:
# i) Extrair mês do nascimento
query_3_i = """
SELECT EXTRACT(MONTH FROM datanasc) AS mes_nascimento
FROM empregado;
"""
df_i = pd.read_sql(query_3_i, conn)
df_i

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\114229543.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_i = pd.read_sql(query_3_i, conn)

   mes_nascimento
0             1.0
1            12.0
2             6.0
3             9.0
4             7.0
5             3.0
6            11.0
7             6.0
8             1.0
9             6.0

### j) Idade do empregado na nascença do dependente
- **SELECT e.pnome, e.unome, d.nomedep, EXTRACT(YEAR FROM d.datanascdep) - EXTRACT(YEAR FROM e.datanasc) AS idade_na_nascenca_do_filho**: Seleciona os nomes do empregado e do dependente, e calcula a idade do empregado no momento do nascimento do dependente usando a função `EXTRACT`.
- **FROM empregado e**: Consulta a partir da tabela `empregado` com um alias `e`.
- **JOIN dependente d ON e.ssn = d.essn**: Realiza um `JOIN` entre as tabelas `empregado` e `dependente`, associando cada empregado a seus dependentes.
- **WHERE d.parentesco IN ('FILHO', 'FILHA')**: Filtra os dependentes para incluir apenas aqueles que são filhos ou filhas do empregado.

In [12]:
# j) Idade do empregado na nascença do dependente
query_3_j = """
SELECT e.pnome, e.unome, d.nomedep, EXTRACT(YEAR FROM d.datanascdep) - EXTRACT(YEAR FROM e.datanasc) AS idade_na_nascenca_do_filho
FROM empregado e
JOIN dependente d ON e.ssn = d.essn
WHERE d.parentesco IN ('FILHO', 'FILHA');
"""
df_j = pd.read_sql(query_3_j, conn)
df_j

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\670829966.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_j = pd.read_sql(query_3_j, conn)

   pnome  unome  nomedep  idade_na_nascenca_do_filho
0   Joao  Souza    Alice                        23.0
1   Joao  Souza   Michel                        23.0
2  Fabio   Will  Teodoro                        28.0
3  Fabio   Will    Alice                        31.0

### k) Número de dependentes por ano de nascimento
- **SELECT EXTRACT(YEAR FROM datanascdep) AS ano_nascimento, COUNT(*) AS numero_dependentes**: Utiliza a função `EXTRACT` para obter o ano de nascimento dos dependentes e `COUNT(*)` para contar quantos dependentes nasceram em cada ano.
- **FROM dependente**: A consulta é realizada na tabela `dependente`.
- **GROUP BY EXTRACT(YEAR FROM datanascdep)**: Agrupa os resultados pelo ano de nascimento dos dependentes.
- **ORDER BY ano_nascimento**: Ordena os resultados pelo ano de nascimento em ordem ascendente.

In [13]:
# k) Número de dependentes por ano de nascimento
query_3_k = """
SELECT EXTRACT(YEAR FROM datanascdep) AS ano_nascimento, COUNT(*) AS numero_dependentes
FROM dependente
GROUP BY EXTRACT(YEAR FROM datanascdep)
ORDER BY ano_nascimento;
"""
df_k = pd.read_sql(query_3_k, conn)
df_k

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\134580009.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_k = pd.read_sql(query_3_k, conn)

   ano_nascimento  numero_dependentes
0          1942.0                   1
1          1958.0                   1
2          1967.0                   1
3          1970.0                   1
4          1983.0                   1
5          1986.0                   1
6          1988.0                   2

### l) Supervisores com pelo menos dois empregados
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome do empregado que é supervisor.
- **FROM empregado e**: Consulta a partir da tabela `empregado` com um alias `e`.
- **JOIN empregado supervisado ON e.ssn = supervisado.superssn**: Realiza um `JOIN` entre a tabela `empregado` consigo mesma para associar supervisores aos seus supervisados.
- **GROUP BY e.ssn, e.pnome, e.unome**: Agrupa os resultados por supervisor, garantindo que a contagem de supervisados seja realizada para cada supervisor individualmente.
- **HAVING COUNT(supervisado.ssn) >= 2**: Filtra os resultados para incluir apenas os supervisores que têm dois ou mais empregados supervisionados.

In [14]:
# l) Supervisores com pelo menos dois empregados
query_3_l = """
SELECT e.pnome, e.unome
FROM empregado e
JOIN empregado supervisado ON e.ssn = supervisado.superssn
GROUP BY e.ssn, e.pnome, e.unome
HAVING COUNT(supervisado.ssn) >= 2;
"""
df_l = pd.read_sql(query_3_l, conn)
df_l

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\737698328.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_l = pd.read_sql(query_3_l, conn)

     pnome  unome
0  Joaquim  Brito
1    Fabio   Will

### m) Valor mensal por projeto
- **SELECT p.pjnome AS nome_projeto, SUM(e.salario) AS valor_mensal**: `p.pjnome` é renomeado para `nome_projeto`, e `SUM(e.salario)` calcula a soma dos salários de todos os empregados que trabalham em cada projeto.
- **FROM trabalha t**: Especifica a tabela `trabalha` com um alias `t`.
- **JOIN empregado e ON t.essn = e.ssn**: Realiza um `JOIN` entre as tabelas `trabalha` e `empregado` para associar as horas trabalhadas ao salário dos empregados.
- **JOIN projeto p ON t.pno = p.pnumero**: Realiza outro `JOIN` entre as tabelas `trabalha` e `projeto` para associar as horas trabalhadas ao projeto correspondente.
- **GROUP BY p.pjnome**: Agrupa os resultados por nome do projeto, necessário para calcular o valor mensal total para cada projeto.

In [15]:
# m) Valor mensal por projeto
query_3_m = """
SELECT p.pjnome AS nome_projeto, SUM(e.salario) AS valor_mensal
FROM trabalha t
JOIN empregado e ON t.essn = e.ssn
JOIN projeto p ON t.pno = p.pnumero
GROUP BY p.pjnome;
"""
df_m = pd.read_sql(query_3_m, conn)
df_m

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\2185216544.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_m = pd.read_sql(query_3_m, conn)

       nome_projeto  valor_mensal
0     Automatizacao       50000.0
1          ProdutoZ       38000.0
2          ProdutoY       55000.0
3  Novos Beneficios       93000.0
4          ProdutoX       55000.0
5     Reorganizacao       98000.0

### Query 4a
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como a fonte dos dados com o alias `e`.
- **WHERE e.ssn IN (...)**: Filtra os empregados cujo número de segurança social (`ssn`) está na lista retornada pela subconsulta.
- **Subconsulta**:
  - **SELECT d.essn FROM dependente d**: Seleciona os `essn` de dependentes.
  - **WHERE d.nomedep = e.pnome AND d.sexodep = e.sexo**: Filtra dependentes que têm o mesmo nome e sexo que o empregado.

In [16]:
query_4_a = """
SELECT e.pnome, e.unome
FROM empregado e
WHERE e.ssn IN (
    SELECT d.essn
    FROM dependente d
    WHERE d.nomedep = e.pnome
      AND d.sexodep = e.sexo
);
"""
df_4_a = pd.read_sql(query_4_a, conn)
df_4_a

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3355005041.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_a = pd.read_sql(query_4_a, conn)

Empty DataFrame
Columns: [pnome, unome]
Index: []

### Query 4b
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como a fonte dos dados.
- **WHERE e.salario > (...)**: Filtra empregados cujo salário é maior que o valor retornado pela subconsulta.
- **Subconsulta**:
  - **SELECT AVG(salario) FROM empregado WHERE dno = '5'**: Calcula a média dos salários dos empregados que trabalham no departamento 5.

In [17]:
query_4_b = """
SELECT e.pnome, e.unome
FROM empregado e
WHERE e.salario > (
    SELECT AVG(salario)
    FROM empregado
    WHERE dno = '5'
);
"""
df_4_b = pd.read_sql(query_4_b, conn)
df_4_b

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1725863363.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_b = pd.read_sql(query_4_b, conn)

      pnome    unome
0     Fabio     Will
1  Jennifer  Wallace
2   Ricardo   Nantes
3   Joaquim    Brito
4   Roberto    Silva
5   Roberto    Silva

### Query 4c
- **SELECT DISTINCT t1.essn**: Seleciona os números de segurança social únicos dos empregados.
- **FROM trabalha t1**: Define a tabela `trabalha` como fonte de dados com o alias `t1`.
- **WHERE (t1.pno, t1.horas) IN (...)**: Filtra empregados que trabalham nos mesmos projetos e com as mesmas horas que 'Fabio Will'.
- **Subconsulta**:
  - **SELECT t2.pno, t2.horas FROM trabalha t2 WHERE t2.essn = '333445555'**: Seleciona os projetos e as horas trabalhadas por 'Fabio Will'.
- **AND t1.essn <> '333445555'**: Exclui 'Fabio Will' dos resultados.

In [18]:
query_4_c = """
SELECT DISTINCT t1.essn
FROM trabalha t1
WHERE (t1.pno, t1.horas) IN (
    SELECT t2.pno, t2.horas
    FROM trabalha t2
    WHERE t2.essn = '333445555'
)
AND t1.essn <> '333445555';
"""
df_4_c = pd.read_sql(query_4_c, conn)
df_4_c

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1298578224.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_c = pd.read_sql(query_4_c, conn)

Empty DataFrame
Columns: [essn]
Index: []

### Query 4d
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como fonte de dados.
- **WHERE e.ssn NOT IN (...)**: Filtra empregados que não estão listados na subconsulta, ou seja, que não trabalham em nenhum projeto.
- **Subconsulta**:
  - **SELECT t.essn FROM trabalha t**: Seleciona os SSNs de todos os empregados que trabalham em algum projeto.

In [19]:
query_4_d = """
SELECT e.pnome, e.unome
FROM empregado e
WHERE e.ssn NOT IN (
    SELECT t.essn
    FROM trabalha t
);
"""
df_4_d = pd.read_sql(query_4_d, conn)
df_4_d

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\4004894062.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_d = pd.read_sql(query_4_d, conn)

     pnome  unome
0    Fabio   Will
1  Roberto  Silva
2  Roberto  Silva

### Query 4e
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como fonte de dados.
- **WHERE e.ssn NOT IN (...)**: Filtra empregados que não estão listados na subconsulta, ou seja, que não têm dependentes.
- **Subconsulta**:
  - **SELECT d.essn FROM dependente d**: Seleciona os SSNs de todos os empregados que têm dependentes.

In [20]:
query_4_e = """
SELECT e.pnome, e.unome
FROM empregado e
WHERE e.ssn NOT IN (
    SELECT d.essn
    FROM dependente d
);
"""
df_4_e = pd.read_sql(query_4_e, conn)
df_4_e

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\636518637.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_e = pd.read_sql(query_4_e, conn)

     pnome     unome
0  Ricardo    Nantes
1  Alberto  Medeiros
2  Joaquim     Brito
3  Roberto     Silva
4    Alice     Zebra
5  Roberto     Silva

### Query 4f
- **SELECT e.unome**: Seleciona o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como fonte de dados.
- **WHERE e.ssn IN (...)**: Inclui empregados cujos SSNs estão na lista de gerentes de departamento retornada pela primeira subconsulta.
- **AND e.ssn NOT IN (...)**: Exclui empregados cujos SSNs estão na lista de empregados com dependentes retornada pela segunda subconsulta.
- **Subconsulta 1**:
  - **SELECT d.gerssn FROM departamento d**: Seleciona os SSNs dos gerentes de departamento.
- **Subconsulta 2**:
  - **SELECT dep.essn FROM dependente dep**: Seleciona os SSNs de todos os empregados que têm dependentes.

In [21]:
query_4_f = """
SELECT e.unome
FROM empregado e
WHERE e.ssn IN (
    SELECT d.gerssn
    FROM departamento d
)
AND e.ssn NOT IN (
    SELECT dep.essn
    FROM dependente dep
);
"""
df_4_f = pd.read_sql(query_4_f, conn)
df_4_f

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3078355420.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_f = pd.read_sql(query_4_f, conn)

   unome
0  Brito

### Query 4g
- **SELECT e.pnome, e.unome**: Seleciona o primeiro nome e o sobrenome dos empregados.
- **FROM empregado e**: Define a tabela `empregado` como fonte de dados.
- **WHERE e.ssn IN (...)**: Inclui empregados cujos SSNs estão na lista de gerentes de departamento retornada pela subconsulta.
- **AND EXISTS (...)**: Adiciona uma cláusula que verifica se existem entradas na tabela `dependente` que correspondam ao SSN do empregado, filtrando para incluir apenas gerentes que têm dependentes.
- **Subconsulta**:
  - **SELECT 1 FROM dependente dep WHERE dep.essn = e.ssn**: Verifica a existência de dependentes para o gerente atual.

In [22]:
query_4_g = """
SELECT e.pnome, e.unome
FROM empregado e
WHERE e.ssn IN (
    SELECT gerssn
    FROM departamento
)
AND EXISTS (
    SELECT 1
    FROM dependente dep
    WHERE dep.essn = e.ssn
);
"""
df_4_g = pd.read_sql(query_4_g, conn)
df_4_g

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3070367589.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_g = pd.read_sql(query_4_g, conn)

      pnome    unome
0      Joao    Souza
1  Jennifer  Wallace

### Query 5a
- **CREATE TABLE tempEmpregado AS**: Cria uma nova tabela chamada `tempEmpregado` no banco de dados.
- **SELECT ssn, pnome, sexo, endereco, datanasc**: Especifica as colunas selecionadas da tabela `empregado` para serem inseridas na nova tabela.
- **FROM empregado**: Define a tabela `empregado` como a fonte dos dados para a criação da nova tabela.
- **Detalhe**: Aqui eu percebi que eu terei que excluir a tabela caso ela exista pra que a query 5_a funcione.

In [23]:
# Drop Table tempEMPREGADO
cur.execute("DROP TABLE IF EXISTS tempEMPREGADO;")

In [24]:
# Criando uma nova tabela tempEmpregado a partir da tabela empregado
query_5_a = """
CREATE TABLE tempEmpregado AS
SELECT ssn, pnome, sexo, endereco, datanasc
FROM empregado;
"""
cur.execute(query_5_a)

### Query 5b
- **EXPLAIN ANALYZE SELECT * FROM tempEmpregado**: Executa a análise do plano de execução do comando SQL para selecionar todos os registros da tabela `tempEmpregado`, ajudando a verificar o tempo de execução.

In [25]:
# Analisando o plano de execução para a seleção de todos os registros da tabela tempEmpregado
query_5_b = """
EXPLAIN ANALYZE SELECT * FROM tempEmpregado;
"""
# Mostrando o plano de execução
df_5_b = pd.read_sql(query_5_b, conn)
df_5_b

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\2087909486.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_b = pd.read_sql(query_5_b, conn)

                                          QUERY PLAN
0  Seq Scan on tempempregado  (cost=0.00..12.90 r...
1                            Planning Time: 0.061 ms
2                           Execution Time: 0.016 ms

### Query 5c
- **CREATE UNIQUE INDEX idx_ssn_tempEmpregado**: Cria um índice único chamado `idx_ssn_tempEmpregado`.
- **ON tempEmpregado (ssn)**: Especifica que o índice será aplicado na coluna `ssn` da tabela `tempEmpregado`.
- **USING BTREE**: Não consegui executar o comando `USING BTREE` no postgress.

In [26]:
# Criando um índice único na coluna ssn usando o método BTREE
query_5_c = """
CREATE UNIQUE INDEX idx_ssn_tempEmpregado
ON tempEmpregado (ssn);
"""
cur.execute(query_5_c)

### Query 5d
- **CREATE INDEX idx_pnome_tempEmpregado**: Cria um índice chamado `idx_pnome_tempEmpregado`.
- **ON tempEmpregado (pnome DESC)**: Aplica o índice na coluna `pnome` em ordem decrescente.
- **USING HASH**: Também não funcionou.

In [27]:
# Criando um índice na coluna pnome em ordem decrescente usando o método HASH
query_5_d = """
CREATE INDEX idx_pnome_tempEmpregado
ON tempEmpregado (pnome DESC);
"""
cur.execute(query_5_d)

### Query 5e
- **EXPLAIN ANALYZE SELECT * FROM tempEmpregado**: Repete a análise do plano de execução após a criação dos índices para ver se há mudanças na performance da consulta.
- **REDUÇÃO DE TEMPO**: O tempo de execução da Query diminuiu consideravelmente ao adicionar indices para busca. Mas também é preciso levar em consideração que temos poucos dados nesse banco, talvez em algo em larga escala surtisse um efeito bem maior.

In [28]:
# Analisando o plano de execução novamente após a criação dos índices
query_5_e = """
EXPLAIN ANALYZE SELECT * FROM tempEmpregado;
"""
df_5_e = pd.read_sql(query_5_e, conn)
df_5_e

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\129061025.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_e = pd.read_sql(query_5_e, conn)

                                          QUERY PLAN
0  Seq Scan on tempempregado  (cost=0.00..1.10 ro...
1                            Planning Time: 0.134 ms
2                           Execution Time: 0.018 ms

### Query 5f
- **DROP INDEX idx_ssn_tempEmpregado**: Remove o índice `idx_ssn_tempEmpregado`.
- **DROP INDEX idx_pnome_tempEmpregado**: Remove o índice `idx_pnome_tempEmpregado`.

In [29]:
# Removendo os índices criados
query_5_f = """
DROP INDEX idx_ssn_tempEmpregado;
DROP INDEX idx_pnome_tempEmpregado;
"""
cur.execute(query_5_f)

### Query 5g
- **DROP TABLE tempEmpregado**: Remove completamente a tabela `tempEmpregado` do banco de dados, incluindo todos os dados e índices associados.

In [30]:
# Removendo a tabela tempEmpregado
query_5_g = """
DROP TABLE tempEmpregado;
"""
cur.execute(query_5_g)

### Query 6a
- **CREATE VIEW TRABALHA_EM AS**: Cria uma visão chamada `TRABALHA_EM`.
- **SELECT e.pnome, e.unome, p.pjnome, t.horas**: Seleciona o primeiro nome e o sobrenome do empregado, o nome do projeto e as horas trabalhadas.
- **FROM empregado e**: Define a tabela `empregado` como a fonte dos dados com o alias `e`.
- **JOIN trabalha t ON e.ssn = t.essn**: Realiza um `JOIN` entre as tabelas `empregado` e `trabalha` com base no número de segurança social do empregado.
- **JOIN projeto p ON t.pno = p.pnumero**: Realiza uma segunda junção entre as tabelas `trabalha` e `projeto` com base no número do projeto.

In [31]:
query_6_a = """
CREATE VIEW TRABALHA_EM AS
SELECT e.pnome, e.unome, p.pjnome, t.horas
FROM empregado e
JOIN trabalha t ON e.ssn = t.essn
JOIN projeto p ON t.pno = p.pnumero;
"""

cur.execute(query_6_a)

In [32]:
# Select * FROM TRABALHA_EM
pd.read_sql("SELECT * FROM TRABALHA_EM;", conn)

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\2749089068.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM TRABALHA_EM;", conn)

       pnome     unome            pjnome  horas
0       Joao     Souza          ProdutoX   32.5
1       Joao     Souza          ProdutoY    7.5
2    Ricardo    Nantes          ProdutoZ   40.0
3    Jussara   Pereira          ProdutoX   20.0
4    Jussara   Pereira          ProdutoY   20.0
5      Alice     Zebra  Novos Beneficios   30.0
6    Alberto  Medeiros     Automatizacao   35.0
7    Alberto  Medeiros  Novos Beneficios    5.0
8   Jennifer   Wallace  Novos Beneficios   20.0
9   Jennifer   Wallace     Reorganizacao   15.0
10   Joaquim     Brito     Reorganizacao    NaN
11     Alice     Zebra     Automatizacao    5.0

### Query 6b
- **SELECT pnome, unome**: Especifica que queremos retornar os campos pnome (primeiro nome) e unome (último nome) dos empregados.
- **FROM TRABALHA_EM**: Indica que a consulta será feita na visão `TRABALHA_EM`.
- **WHERE pjnome = 'ProdutoX'**: Filtra os registros para incluir apenas aqueles onde o nome do projeto é 'ProdutoX'.

In [33]:
query_6_b = """
SELECT pnome, unome
FROM TRABALHA_EM
WHERE pjnome = 'ProdutoX';
"""
df_6_b = pd.read_sql(query_6_b, conn)
df_6_b

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\1417682930.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_b = pd.read_sql(query_6_b, conn)

     pnome    unome
0     Joao    Souza
1  Jussara  Pereira

### Query 6c
- **DROP VIEW TRABALHA_EM**: Remove completamente a visão `TRABALHA_EM` do banco de dados.

In [34]:
query_6_c = """
DROP VIEW TRABALHA_EM;
"""
cur.execute(query_6_c)

### Query 6d
- **CREATE VIEW DEPTO_INFO AS**: Cria uma visão chamada `DEPTO_INFO`.
- **SELECT d.dnome, COUNT(e.ssn) AS total_empregados, SUM(e.salario) AS total_salarios**: Seleciona o nome do departamento, conta o número de empregados e soma os salários dos empregados em cada departamento.
- **FROM departamento d LEFT JOIN empregado e ON d.dnumero = e.dno**: Realiza uma junção entre as tabelas `departamento` e `empregado`, ligando-os pelo número do departamento.
- **GROUP BY d.dnome**: Agrupa os resultados pelo nome do departamento.

In [35]:
query_6_d = """
CREATE VIEW DEPTO_INFO AS
SELECT d.dnome, 
       COUNT(e.ssn) AS total_empregados, 
       SUM(e.salario) AS total_salarios
FROM departamento d
LEFT JOIN empregado e ON d.dnumero = e.dno
GROUP BY d.dnome;
"""
cur.execute(query_6_d)

In [36]:
pd.read_sql("SELECT * FROM DEPTO_INFO;", conn)

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\3369655910.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SELECT * FROM DEPTO_INFO;", conn)

                 dnome  total_empregados  total_salarios
0        Administracao                 3         93000.0
1             Pesquisa                 4        133000.0
2  Sede Administrativa                 3        171000.0

### Query 6e
- **SELECT * FROM DEPTO_INFO**: Seleciona todas as colunas disponíveis na visão `DEPTO_INFO`.
- **ORDER BY total_salarios DESC**: Ordena os resultados pela coluna `total_salarios` em ordem decrescente.

In [37]:
query_6_e = """
SELECT *
FROM DEPTO_INFO
ORDER BY total_salarios DESC;
"""
df_6_e = pd.read_sql(query_6_e, conn)
df_6_e

C:\Users\Ruy\AppData\Local\Temp\ipykernel_396\2788184038.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_e = pd.read_sql(query_6_e, conn)

                 dnome  total_empregados  total_salarios
0  Sede Administrativa                 3        171000.0
1             Pesquisa                 4        133000.0
2        Administracao                 3         93000.0

### Query 6f
- **DROP VIEW DEPTO_INFO**: Remove completamente a visão `DEPTO_INFO` do banco de dados.

In [38]:
query_6_f = """
DROP VIEW DEPTO_INFO;
"""
cur.execute(query_6_f)

In [39]:
#Fechar conexão
cur.close()
conn.close()